app/controllers/docs_controller.rb

    def index
        if params[:corpora_id]
            @corpus = Corpus.find_by_id(params[:corpora_id].to_i)
            @docs = Doc.find(:all, :conditions=>{:corpus_id=>params[:corpora_id].to_i})
---
SELECT * FROM `docs` WHERE (`docs`.`corpus_id` = 2)