app/controllers/documents_controller.rb

  def index
    if params[:corpora_id]
      @corpus = Corpus.find_by_id(params[:corpora_id].to_i)
      @documents = Document.find(:all, :conditions=>{:corpus_id=>params[:corpora_id].to_i})
---
SELECT * FROM `documents` WHERE (`documents`.`corpus_id` = 4)